"""
------------------------------------
@Time :
@Auth :
@File : login_data.py
@IDE  : PyCharm
@Motto:
@QQ   : 28174043@qq.com
@GROUP: 878565760
------------------------------------
"""


class CollaborationData(object):
    """用户登录测试数据
    用户名，密码，期待值"""
    select1_data = [
        ("0","選択してください"),
        ("1","卸売業"),
        ("2","小売業"),
        ("3","IT"),
        ("4","製造業")]
    select2_data = [
        ("0", "選択してください"),
        ("1", "小売業"),
        ("2", "卸売業"),
        ("3", "IT"),
        ("4", "製造業")]
    select3_data = [
        ("0", "選択してください"),
        ("1", "５～１０年"),
        ("2", "１０～２０年"),
        ("3", "２０年以上")]
    select4_data = [
       ("0", "選択してください"),
       ("1", "一次商圈"),
       ("2", "二次商圈"),
       ("3", "商圈外")]
    select5_data = [
       ("0", "選択してください"),
       ("1", "要"),
       ("2", "不要")]
    select6_data = [
       ("0", "選択してください"),
       ("1", "３０日"),
       ("2", "５０日"),
       ("3", "７０日")]


class CollaborationData_2(object):
    """用户登录测试数据
    用户名，密码，期待值"""
    select1_data = [
        ("0","選択してください"),
        ("1","卸売業"),
        ("2","小売業"),
        ("3","IT"),
        ("4","製造業")]
    select2_data = [
        ("0", "選択してください"),
        ("1", "加工食品"),
        ("2", "ITサービス"),
        ("3", "製造業サービス")]
    select3_data = [
        ("0", "選択してください"),
        ("1", "５～１０年"),
        ("2", "１０～２０年"),
        ("3", "２０年以上")]
    select4_data = [
       ("0", "選択してください"),
       ("1", "一次商圈（駐車場併設）"),
       ("2", "二次商圈（駐車場併設）"),
       ("3", "商圈外")]
    select5_data = [
       ("0", "選択してください"),
       ("1", "要"),
       ("2", "不要")]
    select6_data = [
       ("0", "選択してください"),
       ("1", "３０日"),
       ("2", "５０日"),
       ("3", "７０日")]

if __name__ == '__main__':
    pass




