"""
------------------------------------
@Time :
@Auth :
@File : login_data.py
@IDE  : PyCharm
@Motto:
@QQ   : 28174043@qq.com
@GROUP: 878565760
------------------------------------
"""


class RecommendData(object):
    """用户登录测试数据
    用户名，密码，期待值"""
    select1_data = [
        ("0","製造業"),
        ("1","卸売業"),
        ("2","小売業"),
        ("3","IT")]
    select2_data = [
        ("0","経営者")]
    select3_data = [
        ("0", "5~10人未満"),
        ("1", "10~20人未満"),
        ("2", "20~30人未満"),
        ("3", "30~40人未満"),
        ("4", "40~50人未満"),
        ("5", "50人以上")]
    select4_data = [
       ("0", "売上拡大・マーケティング"),
       ("1", "人材活用"),
       ("2", "セキョリティ・リスク管理")]



if __name__ == '__main__':
    pass




